"use strict";

//2. Создайте переменные c=15 и d=2. Просуммируйте их, а результат присвойте переменной result. Выведите на экран значение переменной result.

let c = 15;
let d = 2;
let result = c + d;

alert('c + d = ' +result);

//3. Создайте переменные a=10, b=2 и c=5. Выведите на экран их сумму.

let a = 10;
let b = 2;
c = 5;

alert('a + b + c = '+(a + b + c));

//4. Создайте переменные a=17 и b=10. Отнимите от a переменную b и результат присвойте переменной c. Затем создайте переменную d, присвойте ей значение 7.

a = 17;
b = 10;
c = a - b;
d = 7;

//5. Сложите переменные c и d, а результат запишите в переменную result. Выведите на экран значение переменной result.

result = c + d;

alert('c + d = ' +result);

//6. Создайте переменную str и присвойте ей значение 'Привет, Мир!'. Выведите значение этой переменной на экран.

let str = 'Hello World!';

alert('One variable: ' +str);

//7. Создайте переменные str1='Привет, ' и str2='Мир!'. С помощью этих переменных и операции сложения строк выведите на экран фразу 'Привет, Мир!'.

let str1 = "Hello";
let str2 = "World";

alert('Two variables: ' +str1 + ' ' + str2 + '!');

//8. Создайте переменную name и присвойте ей ваше имя. = Выведите на экран фразу 'Привет, %Имя%!'.

let name = prompt('What is your name?', 'Nemo');

alert('Hello ' + name + '!');

//9. Создайте переменную age и присвойте ей ваш возраст. Выведите на экран 'Мне %Возраст% лет!'.

let age = prompt('How old are you?', '33');

alert('I am ' + age + ' years old!');
